chore: separate editor window from game main window
